{
  "version": 2,
  "exportDate": "2026-02-04T05:34:13.146Z",
  "postings": [
    {
      "company": "Whoop",
      "connectionIds": [],
      "dateAdded": 1770183184069,
      "dateModified": 1770183184069,
      "description": "At WHOOP, we're on a mission to unlock human performance. WHOOP empowers members to perform at a higher level through a deeper understanding of their bodies and daily lives. As a Sensor Intelligence Engineer at WHOOP, you’ll be part of a core team developing algorithms, hardware, and firmware that connect sensor data to health metrics which are foundational to WHOOP. This role will focus on optimizing low-level sensor interfaces to maximize battery life while balancing performance. This will involve developing low-level hardware-control algorithms in C and Python, building tools and pipelines to analyze data, optimizing firmware, and working closely with the embedded and hardware teams at WHOOP.",
      "id": "job_1770183184069_svkrnzv",
      "location": "Boston, MA",
      "notes": "",
      "priority": 2,
      "status": "saved",
      "tags": [],
      "title": "Sensor Intelligence Engineer II (Embedded)",
      "url": "https://jobs.lever.co/whoop/f4100df9-7b86-4d59-b67d-f36d4f783afe"
    },
    {
      "company": "Whoop",
      "connectionIds": [],
      "dateAdded": 1770183135543,
      "dateModified": 1770183135543,
      "description": "At WHOOP, we're on a mission to unlock human performance and healthspan. WHOOP empowers members to perform at a higher level and live longer through a deeper understanding of their bodies and daily lives. Protecting our members’ data and ensuring our systems scale securely and reliably is core to this mission.WHOOP is hiring a Software Engineer II focused on backend development to build and enhance systems that power our platform. This role will directly contribute to delivering scalable and secure services that support millions of members worldwide. While backend development expertise is the primary focus, familiarity with cybersecurity concepts (data privacy, AuthN/AuthZ, etc) or cloud infrastructure concepts (AWS, IaC, Kubernetes, etc) will be considered a strong plus.This is a top-funnel role: depending on your background and interests, you may align more closely with our Product Security team (focused on secure-by-default guardrails, compliance, and data privacy) or our Application Infrastructure team (focused on scalability, reliability, and developer enablement). Either way, you’ll have the opportunity to shape core platform practices and help WHOOP grow to the next level.",
      "id": "job_1770183135543_lvufmt7",
      "location": "Boston, MA",
      "notes": "maybe 2-4 years...",
      "priority": 2,
      "status": "saved",
      "tags": [
        "swe"
      ],
      "title": "Software Engineer II (Backend, Platform)",
      "url": "https://jobs.lever.co/whoop/c329012d-5cf3-4d7a-9816-ba624ef0a311"
    },
    {
      "company": "Whoop",
      "connectionIds": [],
      "dateAdded": 1770182980112,
      "dateModified": 1770182980112,
      "description": "At WHOOP, we're on a mission to unlock human performance and Healthspan. WHOOP empowers members to perform at a higher level through a deeper understanding of their bodies and daily lives. Our wearable technology and analytics platform help individuals optimize recovery, training, and overall health.WHOOP is seeking a Product Designer II to join the Growth team, where you’ll design cross-platform experiences that help more people discover WHOOP and successfully engage with our product. You’ll play a critical role in driving user acquisition, activation, and retention through thoughtful, data-informed, and emotionally resonant design. This role is ideal for a designer who’s passionate about user behavior, loves experimenting for impact, and thrives in fast-paced, collaborative environments.",
      "id": "job_1770182980112_werle4n",
      "location": "Boston, MA",
      "notes": "Need experience with web and mobile!",
      "priority": 2,
      "status": "saved",
      "tags": [],
      "title": "Product Designer II (Growth)",
      "url": "https://jobs.lever.co/whoop/24031086-78bd-461f-8a17-238ffc6b54d0"
    },
    {
      "company": "Whoop",
      "connectionIds": [],
      "dateAdded": 1770182346656,
      "dateModified": 1770182346656,
      "description": "At WHOOP, we're on a mission to unlock human performance. WHOOP empowers users to perform at a higher level through a deeper understanding of their bodies and daily lives.WHOOP is looking for an enthusiastic Embedded Engineer II to join our Software Organization as part of the Embedded Engineering team. You will work with Hardware, Signal Processing, Manufacturing and Product teams to develop and deliver against Hardware and Software roadmaps. The Embedded team’s mission is to build and deploy stable, accurate, and power efficient firmware platforms for all our in house developed devices via a seamless 24/7 connection and interaction between our mobile apps.At Whoop, the Embedded team is at the intersection of the Hardware and Software domains, bridging the gap between the physical and the digital world. As an Embedded Engineer II you will collaborate with a diverse group of the industry’s best and brightest engineers in supporting current products, as well as developing new cutting edge products that help our members achieve their health and fitness goals with industry leading monitoring and data analysis.",
      "id": "job_1770182346656_whjkne3",
      "location": "Boston, MA (Full Time /)",
      "notes": "",
      "priority": 2,
      "status": "saved",
      "tags": [
        "local",
        "embedded"
      ],
      "title": "Embedded Engineer II",
      "url": "https://jobs.lever.co/whoop/2efbec19-bb08-4b0d-87cd-fbac65216111"
    },
    {
      "company": "Whoop logo",
      "connectionIds": [],
      "dateAdded": 1770182328594,
      "dateModified": 1770182328594,
      "description": "At WHOOP, we're on a mission to unlock human performance and healthspan. WHOOP empowers members to perform at a higher level through a deeper understanding of their bodies and daily lives.WHOOP is hiring an iOS Engineer II to join one of our high-impact product teams: AI Experiences or Growth. You’ll work on features that scale our systems and improve reliability, remove friction from user experiences, or help members improve their physical, emotional, and hormonal health through clinical-grade insights. Whether building shared frameworks, iterating on growth experiments, or shipping health-driven features, you'll deliver work that directly impacts our members' lives. You’ll collaborate across functions, write well-architected code, and contribute to a platform that is improving health outcomes and unlocking human potential at scale.",
      "id": "job_1770182328594_x0hraqv",
      "location": "Boston, MA",
      "notes": "",
      "priority": 2,
      "status": "saved",
      "tags": [
        "local",
        "mobile",
        "ai"
      ],
      "title": "iOS Engineer II (Growth & AI Experiences)",
      "url": "https://jobs.lever.co/whoop/ac5d06b2-ff4a-416c-8e60-bcbbfed730fd"
    },
    {
      "company": "Arc Institute",
      "connectionIds": [],
      "dateAdded": 1770174954706,
      "dateApplied": 1770174965896,
      "dateModified": 1770177083477,
      "description": "",
      "id": "job_1770174954706_4gh6hwm",
      "location": "Palo Alto, CA",
      "notes": "",
      "priority": 1,
      "salary": "",
      "status": "applied",
      "tags": [
        "product",
        "academia"
      ],
      "title": "Product Manager, Virtual Cell Challenge",
      "url": "https://job-boards.greenhouse.io/arcinstitute/jobs/5669650004?gh_src=o1za1gtu4us&source=LinkedIn"
    },
    {
      "company": "Ramp",
      "connectionIds": [],
      "dateAdded": 1770173981552,
      "dateModified": 1770173981552,
      "description": "",
      "id": "job_1770173981552_ujau85z",
      "location": "New York, NY",
      "notes": "",
      "priority": 2,
      "salary": "",
      "status": "saved",
      "tags": [
        "product"
      ],
      "title": "Product Manager (generalist - all levels)",
      "url": "https://jobs.ashbyhq.com/ramp/9972df9e-4133-4e2c-9305-49c285b76506"
    },
    {
      "company": "Garmin",
      "connectionIds": [],
      "dateAdded": 1770173416712,
      "dateModified": 1770176340633,
      "description": "",
      "id": "job_1770173416712_13qnha0",
      "location": "Kansas",
      "notes": "",
      "priority": 1,
      "salary": "",
      "status": "rejected",
      "tags": [
        "garmin",
        "embedded"
      ],
      "title": "Embedded Software Engineer",
      "url": "https://careers.garmin.com/jobs/16827?lang=en-us"
    },
    {
      "company": "Toyota Research Institute",
      "connectionIds": [],
      "dateAdded": 1770173113656,
      "dateModified": 1770173113656,
      "description": "",
      "id": "job_1770173113656_vpttqz9",
      "location": "Los Altos, CA",
      "notes": "Connection to Paul Mitiguy",
      "priority": 2,
      "salary": "",
      "status": "saved",
      "tags": [
        "robotics",
        "tri",
        "ml",
        "research"
      ],
      "title": "Robotics Machine Learning Engineer - Platforms for Vision Language Action Foundation Models",
      "url": "https://jobs.lever.co/tri/4cadccc5-8729-4ca9-91ab-d672d14694ac"
    },
    {
      "company": "Toyota Research Institute",
      "connectionIds": [],
      "dateAdded": 1770173073414,
      "dateModified": 1770176338624,
      "description": "",
      "id": "job_1770173073414_pbext0o",
      "location": "Los Altos, CA",
      "notes": "PhD...",
      "priority": 1,
      "salary": "",
      "status": "saved",
      "tags": [
        "tri",
        "robotics",
        "research",
        "ml"
      ],
      "title": "Research Scientist, Trustworthy Learning under Uncertainty (TLU) - Large Behavior Models",
      "url": "https://jobs.lever.co/tri/e7ae7572-0cee-4c92-aaf1-ab9d3f8d692f"
    }
  ],
  "connections": [],
  "settings": {
    "defaultView": "kanban",
    "theme": "light",
    "collapsedColumns": [
      "rejected"
    ]
  }
}